{
  "name": "Santiago Cañas Zapata",
  "short_about_me": "Full Stack Software Developer with 4+ years of experience",
  "about_me": "As a seasoned developer, I've navigated the intricacies of diverse development roles with finesse, skillfully merging creativity with technical acumen. My portfolio reflects a commitment to crafting intuitive user experiences, leveraging a profound understanding of code architecture and design principles. Whether architecting scalable back-end solutions or refining front-end interfaces, my versatile skill set positions me as a dynamic developer ready to drive innovation and deliver impactful solutions.",
  "neostella_experience": "Revolutionized the user experience across multiple large-scale applications by spearheading the development of a dynamic and scalable front-end solution. Leveraged React and TypeScript to architect a modular, micro-frontend system, ensuring seamless integration and optimal performance. My focus on UI/UX brilliance and meticulous TypeScript implementation delivered a consistent, aesthetically pleasing experience across diverse applications, showcasing a track record of successfully navigating and enhancing the functionality of complex digital ecosystems.",
 "geeks5g_experience": "Started as a Full Stack Developer working with React, Node.js, and React Native, contributing to web and mobile product development across various projects. Quickly progressed to Lead Developer, taking ownership of architecture decisions, mentoring junior developers, and ensuring high code quality through peer reviews and best practices. Later transitioned into a Project Management role, where I led cross-functional teams, managed stakeholder communication, and ensured on-time delivery of MVPs and production ready applications. Currently overseeing the entire Software Development Department, managing team capacity, recruitment, technical strategy, process optimization, and high-level project planning. Regularly interface with clients to align technical execution with business goals. Key achievements: Delivered 5+ full-cycle MVPs for U.S. clients with high client satisfaction. Introduced agile workflows and sprint planning tools to improve team velocity and delivery. Built a scalable internal dev structure that supports both web and mobile project pipelines. Actively involved in client interviews, technical scoping, and pre-sales strategy.",
"freelance_experience": "Worked building complex and no complex applications to manage different type of businesses. Using Wordpress to build landing pages for different companies. Using Elementor to complement the building process in Wordpress."
}
